/-!
# 直線の格子点とEuclid のアルゴリズム

整数の割り算についてご存じでしょうか．

整数 $a, b ∈ ℤ$ $(b ≠ 0)$ に対して, $a$ を $b$ で割ったときの余り $r$ $(0 ≤ r < b)$ が計算できるのでした．

この割り算という手続きは，方程式に解があるかどうか，解があるとしたらそれがどんなものかを調べる方法を提供してくれます．

仮に $a = b x$ という方程式が与えられたら，これが整数の範囲，つまり $x ∈ ℤ$ という条件下で解を持つかどうかは, $a$ を $b$ で割ったときの余りで判定できます．余りが 0 なら解があり，0 でなければ解はありません．

シンプルな話ですが，これをもっと推し進めてみましょう．変数を1つ増やして，2変数にしてみます．つまり，直線 $a x + b y = c$ を考えます．これが格子点を持つかどうか，どうやったら判定できるでしょうか．言い換えれば，$x, y ∈ ℤ$ となるような解があるかどうか，あるとしてそれが何か，どうしたら計算できるでしょうか．

これから見ていくように，この問題は Euclid のアルゴリズムと呼ばれる手続きを使うことで解くことができます．
-/
